load_testing/artillery_test.yml
config:
  target: 'http://localhost:3005'
  phases:
    - duration: 10
      arrivalRate: 20
    - duration: 20
      arrivalRate: 10
    - duration: 5 
      arrivalRate: 30
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/dashboard"